[
  {
    "data": [
      {
        "entities": {
          "dates": [
            "This year",
            "NEXT Tuesday",
            "Saturday November 3rd"
          ],
          "foods": [
            "food"
          ],
          "times": [
            "between 8am and 5pm",
            "Several hours"
          ]
        },
        "id": "1668898000d48a95",
        "labelIds": [
          "IMPORTANT",
          "CATEGORY_UPDATES",
          "INBOX"
        ],
        "mimeType": "text/plain",
        "raw": "Dear all, We need five graduate student volunteers AND five undergraduate student volunteers to help with our annual ACM-ICPC programming REGIONAL contest. This year we have a total of 21 teams participating at our site from around the region. Perk Volunteers will get a T-shirt and food and a LOT of satisfaction. Date needed: Saturday November 3rd. Work Time Several hours between 8am and 5pm. If interested, just reply to this email (BY NEXT Tuesday Many Thanks, Simanta",
        "subject": "ACM ICPC Regional Volunteers needed (both Grads and Undergrads)"
      }
    ]
  },
  {
    "data": [
      {
        "entities": {
          "dates": [
            "next year’s",
            "October 2, 2018",
            "Thursday, September 27, 2018",
            "year"
          ],
          "foods": [
            "bbq",
            "dinner"
          ],
          "locations": [
            "Iowa State University",
            "USDA"
          ],
          "places": [
            "Warburton"
          ],
          "times": [
            "9:47:26 AM CDT",
            "9:01 AM"
          ]
        },
        "id": "166354817dff0a56",
        "labelIds": [
          "IMPORTANT",
          "CATEGORY_PERSONAL",
          "INBOX"
        ],
        "mimeType": "text/plain",
        "raw": "In addition to very positive in-person comments there are been a number of emails like thi Begin forwarded message: From: \"Warburton, Marilyn\" < Subject: RE: R F Baker Annual Plant Breeding Field Day and Hatch Act Social BBQ Date: October 2, 2018 at 9:47:26 AM CDT To: \"Singh, Asheesh K [AGRON]\" < \"Plant Breeding and Genetics Graduate Students [AGRON]\" < Cc: \"Plant Breeding and Genetics Faculty [AGRON]\" < \" < Resent-From: < Please excuse the late reply to this email. I also wanted to congratulate all responsible for the excellent field day. It was very professionally run, in addition to being informative and educational! I was so very honored to be a part of it, and the dinner (and sauces and salsas!) were deliciou Best regards, Marilyn Warburton From: Singh, Asheesh K [AGRON] [] Sent: Thursday, September 27, 2018 9:01 AM To: Plant Breeding and Genetics Graduate Students [AGRON] < Cc: Plant Breeding and Genetics Faculty [AGRON] < Warburton, Marilyn < Subject: R F Baker Annual Plant Breeding Field Day and Hatch Act Social BBQ Dear students, I congratulate you all for making yesterday’s event a huge succe It was wonderful to see a large turnout for both event We had several non-ISU visitors in attendance, and the feedback I received was very positive. Special thanks to Ben, Kevin and Vishnu for all their hard work in organizing this event. We are very appreciative of R F Baker Center for Plant Breeding to sponsor the two events, as well as support from numerous faculty and staff for their contributions in various aspects of these event We sincerely appreciate Dr. Bosland and Dr. Warburton for gracing the occasion. Thanks to Dr. Bosland and Dr. Beavis for bringing chili sample Thanks to Dr. Lamkey for spending the day with us, and all faculty members and their teams for presenting and/or for joining the event. If you have feedback for this year’s event and/or suggestions for next year’s event, please email me directly. Best regards, Asheesh K Singh (Danny) Associate Professor Monsanto Chair in Soybean Breeding 1501 Agronomy Hall, Iowa State University 515-294-3268 This electronic message contains information generated by the USDA solely for the intended recipient Any unauthorized interception of this message or the use or disclosure of the information it contains may violate the law and subject the violator to civil or criminal penaltie If you believe you have received this message in error, please notify the sender and delete the email immediately. Patrick S. Schnable C.F. Curti Distinguished Professor Iowa Corn Endowed Chair in Genetics Baker Scholar of Agricultural Entrepreneurship Director, Plant Sciences Institute 2035B Roy J Carver Co-Lab 1111 WOI Rd Iowa State University Ames, IA 50011-3650 USA 515-294-0975 (office) Twitter:",
        "subject": "Fwd: R F Baker Annual Plant Breeding Field Day and Hatch Act Social BBQ"
      }
    ]
  },
  {
    "data": [
      {
        "entities": {
          "foods": [
            "cookies",
            "pizza"
          ],
          "locations": [
            "Coover Hall"
          ],
          "places": [
            "M2I",
            "West Atrium"
          ],
          "times": [
            "tonight",
            "5:30-7 p.m. Begin"
          ]
        },
        "id": "165ca76f4cd989f3",
        "labelIds": [
          "IMPORTANT",
          "CATEGORY_PERSONAL",
          "INBOX"
        ],
        "mimeType": "text/plain",
        "raw": "Remember that Scholar Fair is tonight. Come see Union Pacific, Cyclone Space Mining, M2I, IEEE/HKN, Microcart, Bioengineering Lab, Wind Energy Lab, Digital Women, and Many More Free pizza, pop, and cookies 5:30-7 p.m. Begin in West Atrium (by the moth entrance) Come and join your friends for prizes in the drive! Vicky Thorland-Oster, Manager ECpE Student Services 1212 Coover Hall 2520 Osborn Dr Ames, IA 50011-1046 Phone: 515-294-8778 Fax: 515-294-2678",
        "subject": "Don't forget Scholars' Fair - tonight!!!"
      }
    ]
  },
  {
    "data": [
      {
        "entities": {
          "foods": [
            "food"
          ],
          "locations": [
            "Iowa State University",
            "Engineering"
          ]
        },
        "id": "165aae01614383d1",
        "labelIds": [
          "IMPORTANT",
          "CATEGORY_UPDATES",
          "INBOX"
        ],
        "mimeType": "text/plain",
        "raw": "Welcome Engineering Students! Quick Guide to Engineering Information Technology Resources Computer Lab information Want to know where the Engineering labs are? Want to see if a lab has open seats before walking around campu Visit our site at Keep Your Computer Labs Clean! Take pride in your computer labs! Please pickup after yourself and keep the labs clean for you and everyone else. As always, there is NO FOOD OR DRINK allowed in computer lab Lost and Found If you lose an item in one of the computer labs or need to turn in a lost item, please visit one of our Lost and Found location 2071 Black Engineering, 2215 Coover Hall, 2240 Hoover Hall, and 1200 Howe Hall. Remember to write your name on calculators and other items of value so they can be easily identified if lost. We will require proof before returning lost item Printing As an Engineering student you receive 4,000 print units per semester. Black and white printing is 5 units per side and color is 15 units per side. Lab computers automatically have local printers added. You are also able to print from a personal computer using Papercut Web Print or Google Print. Please visit and for detail Remote Acce Many of the applications available in the computer labs are also available remotely using your own computer. Please visit for more details and instructions on how to connect. CyBox ISU offers all students unlimited storage through a partnership with called CyBox. Visit for detail Personal Drive Please note it is limited to 10 GB. Microsoft Office and Engineering applications for FREE! For a list of titles, visit our IT portal at Departmental Specific Resources Did you know each major has their own dedicated IT staff? Check with your departmental IT staff for information about unique resources available to your major. Other Question All this information and more can be found at . If you have any other questions, please fill out our contact form located at Please remember when contacting us that your ISU e-mail addre is the most important piece of information we need about you. Your University ID (9-digit number) is not needed. Distributed by Engineering Technology Support. Copyright © 2018, Iowa State University of Science and Technology. All rights reserved. You are receiving this message as a student at Iowa State University. Unsubscribe",
        "subject": "Welcome Engineering Students to your Engineering Information Technology resources!"
      }
    ]
  },
  {
    "data": [
      {
        "entities": {
          "dates": [
            "September",
            "Tuesday, Sept. 11",
            "Sept. 11",
            "Sept. 6",
            "Sept. 18",
            "Tuesday",
            "Sept. 28",
            "Sept. 25",
            "the year",
            "Sept. 4"
          ],
          "foods": [
            "pizza"
          ],
          "locations": [
            "Iowa State University",
            "State"
          ],
          "places": [
            "Iowa",
            "USA",
            "Long Que",
            "Ohio"
          ],
          "times": [
            "12 p.m. ",
            "5:30 p.m. ",
            "11 a.m FAN",
            "5:30 p.m 7 p.m",
            "10 a.m",
            "5 minutes"
          ]
        },
        "id": "165a52389f5bef4f",
        "labelIds": [
          "IMPORTANT",
          "CATEGORY_UPDATES",
          "INBOX"
        ],
        "mimeType": "text/plain",
        "raw": "September Undergraduate Newsletter Curriculum Corner Welcome back from all of us in Student Services! We are trying to meet as many of you as possible in the first 10 days of classes to make sure everything is set for your semester! If it is like the summer—it will whiz by! 1) Please note that we will be celebrating Scholars’ Fair on Tuesday, Sept. 11, from 5:30 p.m. – 7 p.m. Please join us in the excitement of student organization membership, faculty and grad student research and lots of giveaway 2) Welcome Dr Mai Zheng and Mohamed Selim as new computer engineering faculty members! You’ll probably see them in the hallways of Coover. 3) Remember that appointments can be made on AccessPlus . 4) As you think of spring semester, we will be teaching EE 439, EE 425x and Cpr E/EE 503X (see the experimental course list 5) If you are still looking for a part-time job, Vicky is trying to find an undergrad TAs for Engr 160, Cpr E 381, EE/Cpr E 294 and 394 Undergraduate Circuit First FAN Club meeting of the year, 9/28 - FREE PIZZA!!! Want to be a part of something more Join one of our student orgs! From solar decatholons to engineering ambassadors, we have so much for you!! Click here to see all our student organization  Don't forget about all of our opportunities to better your chances of scoring a job at the career fair! Study Abroad Fair, Tuesday, Sept. 4 - Come and see ALL the places YOU can study in around the WORLD! Summer Sparks Check out some of the research and moments that happened over this summer!! McCune 1910 surveying notebook 1910 surveying notebook shows Iowa State’s campus through the eyes — and feet — of ECpE alum A notebook from ECpE alum Charles E McCune was recently discover...
